// /lib/data/blog_contents.dart

import 'package:smily/features/Blogs/data/blog_detail_class.dart';

final List<BlogDetails> blogContents = [
  BlogDetails(
    title: 'المشروبات المعلبة مش دايما صحابك',
    imagePath: 'assets/images/blog7.jpg',
    content: '''
يا بطل، لو إنت من الناس اللي بتحب تشرب بيبسي، فانتا، أو حتى عصير مانجا معلب كل يوم، تعالى نحكي شوية عن الموضوع
ده؛ عارف إن طعمهم حلو ومنعش، بس لألسف، الحاجات دي ممكن تبقى عدو خفي ألسنانك!
ليه المشروبات دي بتبّوظ السنان؟
المشروبات الغازية والعصائر المعلبة فيها حاجتين خطر جًدا على سنانك:
.1 السكر:
البكتيريا اللي في ُبقك بتحب السكر جًدا، وبتبدأ تشتغل عليه وتنتج أحماض تهاجم طبقة المينا )اللي بتحمي السنان(. يعني كل ما
مس ّك البكتيريا بتحتفل على حساب سنانك! تشرب حاجة رة،
.2 األحماض:
حتى المشروبات اللي مكتوب عليها "بدون سكر" فيها أحماض زي حمض الستريك أو الفوسفوريك، ودي بتاكل في المينا برضو
وتضعف السنان.
إيه اللي ممكن يحصل؟
● تسّوس أسرع، خصو ًصا في الضروس.
● حساسية في األسنان من الحاجات السخنة أو الساقعة.
● بقع أو تغّيرات في لون السنان.
● وفي الحاالت الشديدة، ممكن تخسر جزء من السنة نفسها.
طب أعمل إيه؟ أب ّطلها خالص؟
مش الزم تقطعها تما ًما، بس خليك ذكى
● قلّل ُشربها وخليها في المناسبات بس.
● بعد ما تشربها، اشرب شوية مّيه.
● متحتفظش بالمشروب في ُبقك، اشربه مرة واحدة مش على مراحل.
فاطة )straw )عشان تقلل تالمسه مع السنان.
● استخدم شّ
● وخلّي عندك روتين ثابت لغسيل سنانك مرتين في اليوم بمعجون فيه فلورايد.
الخالصة:
مش كل حاجة طعمها حلو تبقى مفيدة. سنانك نعمة، وحمايتها بتبدأ من اختياراتك اليومية. فكر مرتين قبل ما تفتح الكانز، وافتكر
داي ًما إن ضحكتك الحلوة تستاهل تحافظ عليها
''',
  ),
  BlogDetails(
    title: 'هل ُشرب المياه له عالقة بصحة الفم؟',
    imagePath: 'assets/images/blog9.jpg',
    content: '''

''',
  ),
  BlogDetails(
    title: 'فيتامين C وصحة لثتك... الحكاية ببساطة',
    imagePath: 'assets/images/blog8.jpg',
    content: '''
يا ترى سمعت قبل كده عن فيتامين "C"؟ أكيد سمعت!
هو الفيتامين اللي داي ًما بيقولوا إنه مهم علشان يقّوي المناعة، بس اللي يمكن متعرفهوش إنه كمان صديق اللثة األول.
طيب يعني إزاي؟
لثتك يا بطل زي أي جزء من جسمك، محتاجة تتغذى كويس علشان تفضل قوية وصحية. فيتامين C بيساعد جسمك يصنع حاجة
اسمها "الكوالجين"، وده بروتين مهم جًدا بيساعد اللثة تبقى متماسكة وما يحصلهاش مشاكل.
إيه اللي ممكن يحصل لو جسمك مش بياخد فيتامين C كفاية؟
● ممكن تالحظ إن لثتك بتنزف بسهولة، وده بيحصل عند ناس كتير.
● كمان ممكن تكون لثتك لونها أحمر أو تبقى منتفخة.
● وفي حاالت نادرة جًدا، ممكن يحصل مرض اسمه "األسقربوط"، وده بيخلي اللثة تلتهب جًدا وتبقى مؤلمة ومزعجة.
فين بقى تالقي فيتامين C؟
في حاجات كتير ولذيذة بنحبها، زي:
● البرتقال واليوسفي
● الفراولة
● الجوافة )دي بقى بطلة فيتامين C)
● الفلفل األلوان
● الكيوي
نصيحة سريعة يا بطل:
حاول تاكل حاجة فيها فيتامين C كل يوم، ومتنساش تغسل سنانك مرتين في اليوم، علشان تحافظ على صحة لثتك وأسنانك وتخلي
ابتسامتك داي ًما منورة.

''',
  ),
  BlogDetails(
    title: 'تفتكر السخن وراه ساقع ممكن يبّوظ سنانك؟',
    imagePath: 'assets/images/blog11.jpg',
    content: '''
يا بطل، عمرك ج ّربت تشرب شاي سخن وبعدين على طول تشرب مياه ساقعة من التالجة؟
أو تاكل شوربة مولعة وتكّملها بآيس كريم؟
طب يا ترى ده ممكن يضر سنانك؟ تعال نفهم الموضوع مع بعض ببساطة.
هو السنان بتحس؟!
أكيد يا بطل! جوا سنانك في أعصاب، وفي طبقة اسمها العاج )Dentin)، ودي حساسة جًدا ألي تغيير في السخونة أو البرودة.
لما تنقل فجأة من حاجة سخنة لحاجة ساقعة، بتعمل صدمة حرارية للسنان، وده ممكن يسبب:
● وجع أو حساسية: تحس بوخز أو ألم مفاجئ، خصو ًصا لو عندك تسّوس أو لثتك ضعيفة.
● شروخ صغيرة: التغيير المفاجئ في الحرارة ممكن يعمل شروخ خفيفة في الطبقة الخارجية )المينا(، ومع الوقت ممكن
تكبر وتضّعف ال ِسن.
● إجهاد للمينا: المينا بتحمي سنانك، ولما تتعرض لحرارة وبرودة بشكل مفاجئ، بتتعب وممكن تبدأ تتآكل أو تتكسر بسهولة.
نب ناكل الحاجات دي؟ ّط يعني ل
مش كده خالص، بس خد بالك شوية:
ما تنقلش من السخن للساقع فجأة.
استنى شوية بين الحاجة السخنة واللي بعدها ساقعة.
خلي األكل والشرب في حرارة معتدلة، ال مولع وال ساقع تلج.
ولو حسيت إن سنانك بتوجعك بسهولة، اسأل دكتور األسنان يشوف لو محتاج عالج أو معجون خاص بالحساسية.
الخالصة؟
أسنانك مش روبوت، هي بتحس وتتأثر.
فلو بتحبها وعايز تحافظ عليها، بالش تفاجئها بحاجات سخنة وساقعة ورا بعض. خليك أح ّن عليها شوية.

''',
  ),
  BlogDetails(
    title: 'القهوة والشاي.. صحبة المزاج ولا أعداء الاسنان؟',
    imagePath: 'assets/images/blog12.jpg',
    content: '''
يا بطل، لو إنت من الناس اللي يومهم ما يبدأش غير بكوباية شاي أو قهوة، فالمقال ده مخصوص ليك!
تعالى نعرف سوا تأثير المشروبات دي على فمك وسنانك، وخصو ًصا وإنت في سن المراهقة.
.1 الكافيين.. صاحب المزاج اللي بيغدر!
القهوة والشاي فيهم كافيين، وده بيديك طاقة وصحصحة، بس كمان بيقلل كمية اللعاب في الفم،
طيب يعني إيه؟
يعني الفم يبقى ناشف، وده ممكن يزّود فرصة التسوس، والتهابات اللثة، وكمان ريحة الفم الوحشة.
.2 التلوين مش بس في الشعر!
القهوة والشاي فيهم مادة اسمها "تانينز" )tannins)، ودي بتلتصق بسطح األسنان وتسبب اصفرار وبقع.
وده ممكن يأثر على شكل ضحكتك وثقتك في نفسك.
ة!
.3 السكر بيزود الطين بلّ
كتير مننا بيحب يشرب القهوة أو الشاي بسكر كتير أو مبيضات صناعية.
المشكلة إن الحاجات دي بتغذي البكتيريا اللي بتسبب تسوس وأمراض في اللثة.
طب نعمل إيه؟
● حاول تقلل من عدد مرات شرب القهوة والشاي في اليوم.
● اشرب مياه بعدها علشان تنظف بقك.
● لو بتحب الحاجات الباردة زي اآليس كوفي، استخدم شفاطة.
● متنساش تغسل سنانك مرتين في اليوم بمعجون فيه فلورايد.
وزيارة دكتور األسنان كل 6 شهور دي مش رفاهية، دي خطوة مهمة علشان تحافظ على ابتسامتك.

''',
  ),
  BlogDetails(
    title: 'ليه األسنان بتحب اللبن والجبنة؟',
    imagePath: 'assets/images/blog3.jpg',
    content: '''
يا بطل، أكيد سمعت قبل كده إن اللبن مفيد للعظام، بس تعالى أقولك سر... هو كمان بيحمي األسنان جًدا!
إزاي اللبن والجبنة بيساعدوا أسنانك؟
.1 كالسيوم x كالسيوم = أسنان قوية:
اللبن والجبنة مليانين كالسيوم، وده المعدن األساسي اللي بيبني األسنان وبيخليها صلبة ومتينة، كأنها جيش بيحمي فمك من التسوس.
.2 فيتامين D = بطل الكالسيوم:
من غير فيتامين D، جسمك مش هيعرف يستفيد كويس من الكالسيوم. اللبن المدعم بفيتامين D بيساعد جسمك ياخد فايدة أكتر.
.3 الجبنة ضد التسوس:
عارف إن قطعة جبنة صغيرة بعد األكل ممكن تقلل من الحموضة اللي بتكسر في مينا األسنان؟ دي حاجة العلماء أثبتوها في
دراسات كتير.
طيب يعني الزم أشرب قد إيه لبن؟
لو سنك بين 12 و15 سنة، محتاج حوالي ٣ أكواب لبن أو ما يعادلهم من منتجات األلبان يومًيا. يعني ممكن تشرب كوب، وتاكل
زبادي، وجبنة؛ كده جسمك وأسنانك هيبقوا مبسوطين!
ملحوظة مهمة جًدا:
لو عندك حساسية من اللبن، أو مش بتحبه، فيه بدائل زي لبن الصويا المدعم بالكالسيوم، وكمان ممكن تاكل حاجات تانية فيها
كالسيوم زي السمسم، أو السردين.

''',
  ),
  BlogDetails(
    title: 'ليه لثتك بتنزل دم وانت بتاكل؟ \nالموضوع مش بسيط يا بطل',
    imagePath: 'assets/images/blog13.jpg',
    content: '''
يا بطل،عمرك كنت بتاكل ساندويتش لذيذ وفجأه حسيت بطعم الدم؟ أو وانت بتف ّرش سنانك لقيت اللثة لت
نز دم؟ ده مش عادي ِ
ومينفعش تس ُكت عليه.
أسباب نزيف اللثة ممكن تكون:
.1 مش بتغسل سنانك كويس:
لو بتكسل أو بتعدي بالفرشاه بسرعه، بيبدأ الجير يتراكم حوالين األسنان، وده ي
بيخل اللثة تلتهب وتنزف. ّ
.2 بتضغط وانت بتف ّرش:
فرشاة السنان مش كأنك بتنضف بالط! لو ضغطت جامد، هتجرح اللثة، وده بيخليها تنزف.
.3 نقص فيتامين C:
فيتامين C مهم للثه عشان تفضل قوية؛ فلو أكلك مفهوش فواكه زي البرتقال أو فلفل ألوان، ممكن جسمك يضعف وساعتها اللثة تبقي
حساسه وتنزل دم.
.4 تقويم األسنان:
مر ّك تقويم، ممكن يكون بيحتك باللثة ويسبب جروح بسيطه. ل
''',
  ),
  BlogDetails(
    title: 'أنواع فرش األسنان وتأثيرها على صحة الفم',
    imagePath: 'assets/images/blog10.jpg',
    content: '''
1 فرشاة األسنان اليدوية )العادية(
الفرشاة الناعمة )Bristles Soft):
دي أنسب اختيار لمعظم الناس، خصو ًصا لو لثتك حساسة. بتساعد على تنظيف األسنان من غير ما تجرح اللثة أو تسبب تآكل في
مينا األسنان.
الفرشاة المتوسطة )Bristles Medium):
بتنظف كويس، لكن ممكن تسبب شروخ صغيرة في اللثة لو استخدمتها بقوة.
الفرشاة القاسية )Bristles Hard):
بتشيل البالك بسرعة، لكن ممكن تجرح اللثة وتسبب تآكل في مينا األسنان، وده مش كويس على المدى الطويل.
.2 فرشاة األسنان الكهربائية
الدراسات بتقول إن الفرشاة الكهربائية بتقلل البالك والتهاب اللثة أكتر من الفرشاة العادية، خصو ًصا لو كانت من النوع اللي بيلف
وبيهتز.
أخطاء شائعة في استخدام فرشاة األسنان
● الضغط الزائد أثناء التفريش:
ممكن يسبب تآكل في مينا األسنان وجروح في اللثة.
● التفريش بعد األكل مباشرة:
خصو ًصا بعد األكالت الحمضية، ألن األسنان بتكون ضعيفة شوية. األفضل تستنى 30 دقيقة قبل ما تف ّرش.
● عدم تغيير الفرشاة بانتظام:
الفرشاة الزم تتغير كل 4-3 شهور

''',
  ),
  BlogDetails(
    title: 'إيه هو خيط األسنان؟',
    imagePath: 'assets/images/blog1.jpg',
    content: '''
خيط األسنان هو خيط رفيع بنستخدمه عشان ننضف بين األسنان، وبيوصل لألماكن اللي فرشاة األسنان مش بتوصلها.
ليه الزم تستخدم خيط األسنان؟
● بيقلل التهابات اللثة: دراسة لقت إن الناس اللي بيستخدموا خيط األسنان بيكون عندهم التهابات لثة أقل بكتير من اللي مش
بيستخدموه.
● بيقلل تسوس األسنان: استخدام الخيط بانتظام بيقلل من فرص تسوس األسنان، خصو ًصا في األماكن اللي بين األسنان.
● بيحافظ على صحة الفم: استخدام الخيط مع الفرشة بيخلي فمك نظيف وصحي أكتر.
أنواع خيط األسنان
● خيط مشمع )Waxed): سهل يدخل بين األسنان الضيقة ومش بيتقطع بسهولة.
● خيط غير مشمع )Unwaxed): ممكن يكون أرفع شوية، بس ممكن يتقطع أسرع.
● خيط مائي )Flosser Water): جهاز بيستخدم ضغط المياه لتنضيف بين األسنان، وده مناسب لو بتلبس تقويم.
أخطاء شائعة الزم تتجنبها
● استخدام الخيط بعنف: ممكن يجرح لثتك. استخدمه بلطف.
● نسيان استخدام الخيط: استخدامه مرة واحدة في اليوم بيكفي، بس الزم يكون بانتظام.
● استخدام خيط قديم أو متسخ: استخدم قطعة جديدة كل مرة.
نصائح لبطلنا
● ابدأ باستخدام الخيط مرة في اليوم، ويفضل قبل النوم.
● لو عندك تقويم، اسأل دكتور األسنان عن أفضل نوع خيط ليك.
● لو حسيت بأي ألم أو نزيف، استشير دكتور األسنان فو ًرا.

''',
  ),
  BlogDetails(
    title: 'أهمية غسيل األسنان',
    imagePath: 'assets/images/blog6.jpg',
    content: '''
غسيل األسنان مش بس بيخلي نفسنا ريحته حلوة، ده كمان بيحمينا من مشاكل كتير زي تسوس األسنان والتهاب اللثة.
الدراسات بتقول إن غسيل األسنان مرتين في اليوم لمدة دقيقتين بيقلل من تراكم البالك وبيحافظ على صحة اللثة واألسنان.
األخطاء اللي الزم نتجنبها
فيه شوية حاجات لو عملناها غلط ممكن تضر أسنانا ولثتنا:
● الضغط القوي أثناء الغسيل: ده ممكن يسبب تآكل في مينا األسنان و انحسار في اللثة.
● استخدام فرشاة صلبة: الفرشاة الصلبة ممكن تجرح اللثة وتسبب تآكل في األسنان.
● غسيل األسنان بعد األكل مباشرة: خصو ًصا لو األكل كان حمضي، األفضل ننتظر 30 دقيقة قبل الغسيل.
نصائح لبطلنا
● استخدم فرشاة ناعمة: دي بتكون ألطف على اللثة واألسنان.
● اغسل أسنانك مرتين في اليوم: مرة الصبح ومرة قبل النوم، وكل مرة لمدة دقيقتين.
● استخدم معجون فيه فلورايد : الفلورايد بيقوي مينا األسنان وبيحميها من التسوس.
● غير فرشتك كل 3 شهور: أو لما تالقي شعيراتها بدأت تتفتح.

''',
  ),
  BlogDetails(
    title: 'إيه هي حساسية األسنان؟',
    imagePath: 'assets/images/blog2.jpg',
    content: '''
حساسية األسنان بتحصل لما الطبقة اللي بتحمي ال ِسنة )اسمها المينا( تضعف أو تتآكل، وده بيخلي الطبقة اللي تحتها )اسمها العاج(
تبقى مكشوفة.
العاج ده فيه أنابيب صغيرة جًدا بتوصل للعصب، ولما تشرب حاجة سخنة أو ساقعة، السائل اللي جوه األنابيب دي بيتحرك وبيوصل
إحساس األلم للعصب، فبتحس بوخز أو ألم مفاجئ في ال ِسنة.
❗ أسباب حساسية األسنان
● فيه أسباب كتير ممكن تخلي أسنانك حساسة، زي:
● تآكل المينا: بسبب األكل الحمضي أو التفريش العنيف.
● تسوس األسنان: بيكشف العاج وبيخلي ال ِسنة حساسة.
● انحسار اللثة: بيكشف جزء من جذر ال ِسنة، وده بيخليها حساسة.
● تشققات في ال ِسنة: حتى لو صغيرة، ممكن تسبب ألم.
● استخدام منتجات تبييض األسنان بكثرة: ممكن تضعف المينا.
● التهاب في عصب ال ِسنة: لو األلم مستمر أو شديد، ممكن يكون فيه التهاب في العصب.
�� إزاي تحمي أسنانك وتقلل الحساسية؟
● استخدم معجون أسنان مخصص لألسنان الحساسة: ده بيقلل اإلحساس باأللم مع الوقت.
● ف ّرش بأسلوب ناعم: استخدم فرشة ناعمة وما تضغطش جامد.
● قلل من األكل الحمضي والسكر: زي الليمون والمشروبات الغازية.
● زور طبيب األسنان بانتظام: عشان يتابع حالتك ويعالج أي مشاكل بدري.
�� معلومة إضافية
لو األلم بيستمر حتى بعد ما تبطل تشرب أو تاكل، أو بيزيد مع الوقت، ده ممكن يكون عالمة على مشكلة أكبر زي التهاب في
العصب، وساعتها الزم تروح لطبيب األسنان فو ًر
''',
  ),
  BlogDetails(
    title: 'هل ُشرب المياه له عالقة بصحة الفم؟',
    imagePath: 'assets/images/blog9.jpg',
    content: '''

''',
  ),
  BlogDetails(
    title: 'هل ُشرب المياه له عالقة بصحة الفم؟',
    imagePath: 'assets/images/blog9.jpg',
    content: '''

''',
  ),
  BlogDetails(
    title: 'هل ُشرب المياه له عالقة بصحة الفم؟',
    imagePath: 'assets/images/blog9.jpg',
    content: '''

''',
  ),
  BlogDetails(
    title: 'هل ُشرب المياه له عالقة بصحة الفم؟',
    imagePath: 'assets/images/blog9.jpg',
    content: '''

''',
  ),
];
